{"chunk_id": "2401.01872v2_sec0_chunk0", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 0, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "#### Abstract\n\nInternational comparisons of hierarchical time series data sets based on survey data, such as annual country-level estimates of school enrollment rates, can suffer from large amounts of missing data due to differing coverage of surveys across countries and across times. A popular approach to handling missing data in these settings is through multiple imputation, which can be especially effective when there is an auxiliary variable that is strongly predictive of and has a smaller amount of missing data than the variable of interest. However, standard methods for multiple imputation of hierarchical time series data can perform poorly when the auxiliary variable and the variable of interest have a nonlinear relationship. Performance can also suffer if the multiple imputations are used to estimate an analysis model that makes different assumptions about the data compared to the imputation model, leading to uncongeniality between analysis and imputation models. We propose a Bayesian method for multiple imputation of hierarchical nonlinear time series data that uses a sequential decomposition of the joint distribution and incorporates smoothing splines to account for nonlinear relationships between variables. We compare the proposed method with existing multiple imputation methods through a simulation study and an application to secondary school enrollment data. We find that the proposed method can lead to substantial performance increases for estimation of parameters in uncongenial analysis models and for prediction of individual missing values."}
{"chunk_id": "2401.01872v2_sec0_chunk1", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 1, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "data. We find that the proposed method can lead to substantial performance increases for estimation of parameters in uncongenial analysis models and for prediction of individual missing values.\n\n\n1. Introduction. Missing values within hierarchical time series data sets are a common occurrence in social science data, particularly for comparisons across countries and across times that rely on survey data. International surveys may only be conducted in selected years and coverage of countries may differ from year to year, while country-level surveys and censuses may be conducted annually in some countries but may only occur sporadically in others. The presence of missing data can be compounded in settings that require the compilation of data from multiple different sources. One example where this occurs is for school enrollment data, where the UNESCO Institute for Statistics compiles survey and administrative data from countries around the world to create annual, internationally comparable estimates of school enrollment rates. The country-specific time series for school enrollment rates have a hierarchical structure where countries are nested in the world. The differing availability of survey and administrative data across countries and years leads to a large number of country-years in the UNESCO database with missing data."}
{"chunk_id": "2401.01872v2_sec0_chunk2", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 2, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "are nested in the world. The differing availability of survey and administrative data across countries and years leads to a large number of country-years in the UNESCO database with missing data.\n\nFor hierarchical time series data arising from survey data, there can be multiple variables that measure similar underlying quantities but have differing amounts and patterns of missing data. This is the case for school enrollment data, where two commonly reported measures of school enrollment rates are the Net Enrollment Rate (NER) and the Gross Enrollment Ratio (GER). NER is the ratio of children of official secondary school age who are enrolled in secondary school to the population of official secondary school age children, while GER\n\nKeywords and phrases: Multiple imputation, missing data, Bayesian hierarchical model, time series, school enrollment.\n\nis the ratio of total enrollment in secondary school, regardless of age, to the population of official secondary school age children. NER and GER both aim to measure the same underlying quantity of school enrollment. NER can be thought of as a more refined measure of school enrollment that incorporates information about the age of children who are enrolled in school, while GER is a coarser measure of school enrollment that only requires information about the number of children enrolled. NER is more difficult to measure than GER and has a larger amount of missing data."}
{"chunk_id": "2401.01872v2_sec0_chunk3", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 3, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "is a coarser measure of school enrollment that only requires information about the number of children enrolled. NER is more difficult to measure than GER and has a larger amount of missing data.\n\nMore generally, this type of missing data can arise if a survey is designed to collect information on a refined measure of the quantity of interest but includes the option to collect information on a coarse measure of the quantity of interest if the respondent does not provide enough information for the refined measure. For example, a survey on school enrollment might ask for information on the number and ages of children enrolled in school to calculate NER but include the option for respondents to provide only the number of children enrolled to calculate GER. In surveys that do not collect the coarse measure directly, there may exist auxiliary information from external sources, such as administrative records, that can be used as a coarse measure of the quantity of interest. This type of missing data can also occur by design in longitudinal panels to reduce respondent burden. Panel members may be asked to provide basic information for the coarse measure in every cycle of the panel, but may only be asked to provide detailed information for the refined measure in selected cycles. In all of these examples, the refined measure of the quantity of interest tends to have a greater amount of missing data than the coarse measure by nature of being more difficult to measure. If the variable of interest for subsequent analysis is the refined measure, researchers might be interested in how to best leverage information from the coarse measure to impute the variable of interest using a multiple imputation procedure."}
{"chunk_id": "2401.01872v2_sec0_chunk4", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 4, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "is the refined measure, researchers might be interested in how to best leverage information from the coarse measure to impute the variable of interest using a multiple imputation procedure.\n\nMultiple imputation, first developed by Rubin (1978, 1987), is a widely used approach for handling missing data. In multiple imputation, $M>1$ imputed values for missing observations are sampled from the posterior predictive distribution of the missing data given the observed data. The $M$ imputed values result in $M$ completed data sets, each of which consists of the observed data and one set of imputed values for the missing observations. The completed data sets can each be analyzed separately using complete data methods and the results of the analyses can be combined into one final, pooled result using combining rules from Rubin (1987) that account for both within-imputation variation and between-imputation variation. Multiple imputation approaches generally assume data is Missing At Random (MAR) as defined by Rubin (1976). For variable X, MAR occurs when the probability of being missing depends only on the observed portion of $\\mathbf{X}$. A special case of MAR occurs when data is Missing Completely At Random (MCAR) and the probability of being missing does not depend on $\\mathbf{X}$. Data can also be Missing Not At Random (MNAR), which occurs when the probability of being missing depends on the missing portion of $\\mathbf{X}$."}
{"chunk_id": "2401.01872v2_sec0_chunk5", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 5, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "of being missing does not depend on $\\mathbf{X}$. Data can also be Missing Not At Random (MNAR), which occurs when the probability of being missing depends on the missing portion of $\\mathbf{X}$.\n\nWe focus on the setting where the imputation of missing values and the analysis of imputed values are conducted independently. The development of multiple imputation originated in this setting, where Rubin $(1977,1978)$ proposed the multiple imputation framework as a way to provide imputed values for missing responses in public-use releases of large data sets from sample surveys. An appealing feature of multiple imputation for practitioners is the ability to use the same imputed data set to conduct many different analyses (Schafer (1997a); Rubin (1987)). However, using the same multiply imputed data for different analyses can lead to the analysis model being uncongenial to the imputation model in the sense of Meng (1994). An imputation model and an analysis model are congenial if there exists a Bayesian model such that (i) the posterior mean and variance from the Bayesian model for the parameter of interest are asymptotically the same as the mean and variance estimates from the analysis model in both the complete and incomplete data settings and (ii) the posterior predictive distribution of"}
{"chunk_id": "2401.01872v2_sec0_chunk6", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 6, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "interest are asymptotically the same as the mean and variance estimates from the analysis model in both the complete and incomplete data settings and (ii) the posterior predictive distribution of\n\nthe missing data given the observed data derived from the Bayesian model is identical to the imputation model (Meng, 1994). When these two conditions are not met, the imputation and analysis models are uncongenial, and theoretical properties of the multiply imputed estimates created using the simple combining rules of Rubin (1987) may not be guaranteed (Meng (1994); Rubin (1996); Xie and Meng (2017)). Rubin's multiply imputed variance estimator is not guaranteed to be asymptotically unbiased for the true repeated sampling variance of the multiply imputed point estimator under uncongeniality, leading to estimated confidence intervals with less than nominal coverage. Uncongeniality of the analysis and imputation models can be a regular occurrence in practice, particularly when the researchers that collect the survey data create imputed values for publication that are then used in analyses by external researchers. The external researchers may not have access to the same information or resources needed to create imputations of their own, for example if the variables used in the imputation model are not publicly available. Specifically, we consider the scenario where imputation of a variable $\\mathbf{Y}$ for public release is conducted by leveraging the relationship between $\\mathbf{Y}$ and an auxiliary variable $\\mathbf{X}$, where $\\mathbf{X}$ (and imputed values of $\\mathbf{X}$ ) cannot be made publicly available."}
{"chunk_id": "2401.01872v2_sec0_chunk7", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 7, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "is conducted by leveraging the relationship between $\\mathbf{Y}$ and an auxiliary variable $\\mathbf{X}$, where $\\mathbf{X}$ (and imputed values of $\\mathbf{X}$ ) cannot be made publicly available. The multiply imputed values of $\\mathbf{Y}$ are subsequently used by an external researcher in an analysis with an external outcome variable, $\\mathbf{Z}$, which is unknown to the imputer and is not accounted for in the imputation process. In this scenario, the analysis model used by the external researcher is not guaranteed to be congenial to the imputation model. The ability of a multiple imputation method to perform well for uncongenial analyses is thus of interest for practitioners.\n\nFor hierarchical data, multiple imputation approaches that do not explicitly account for the hierarchical structure of the data can lead to biased results in downstream analyses (Taljaard, Donner and Klar (2008); Enders, Mistler and Keller (2016); Lüdtke, Robitzsch and Grund (2017)). Many approaches specifically for multiple imputation of hierarchical time series data have been developed (e.g. Liu, Taylor and Belin (2000); He, Yucel and Raghunathan (2011); Speidel, Drechsler and Jolani (2018); Enders, Du and Keller (2020); Grund, Lüdtke and Robitzsch (2021); among others), with two of the most widely used approaches for social science data being Amelia II and multilevel extensions of Multiple Imputation by Chained Equations (MICE). Amelia, originally developed by King et al. (2001) and extended as Amelia II by Honaker and King (2010), is a multiple imputation method designed specifically for hierarchical time series data. Amelia is based on the joint modeling approach to multiple imputation, where imputed values are sampled from a joint distribution for all variables with missing data."}
{"chunk_id": "2401.01872v2_sec0_chunk8", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 8, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "hierarchical time series data. Amelia is based on the joint modeling approach to multiple imputation, where imputed values are sampled from a joint distribution for all variables with missing data. MICE is a multiple imputation method developed by van Buuren and Groothuis-Oudshoorn (2011) that uses the fully conditional specification (FCS) approach to multiple imputation. Rather than explicitly specifying a joint imputation model, the FCS algorithm iteratively samples from univariate conditional imputation models for all variables with missing data until convergence is reached. Several methods that account for hierarchical data structures have been implemented within the MICE framework, including the linear mixed effects method developed by Schafer and Yucel (2002).\n\nThe most commonly used methods for multiple imputation of hierarchical time series data assume that the variables in the imputation model have a linear relationship. In settings where variables have a strong nonlinear relationship and transformation to approximate linearity is not possible, these methods are misspecified. Failing to account for the nonlinear relationship can lead to imputed relationships between variables that are implausible based on substantive knowledge and biased estimates in analyses using the multiply imputed data. Nonlinear relationships in hierarchical time series data can occur regularly in the social sciences, for example if rates that aim to measure the same quantity are calculated for related populations. This is the case for school enrollment rates, where NER and GER measure school enrollment for slightly different populations of children. Another example arises for"}
{"chunk_id": "2401.01872v2_sec0_chunk9", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 9, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "for related populations. This is the case for school enrollment rates, where NER and GER measure school enrollment for slightly different populations of children. Another example arises for\n\ncontraceptive prevalence rates, where country-level estimates of contraceptive prevalence for married and unmarried women have a nonlinear relationship when pooled across countries and times. Measurement of contraceptive use is more difficult for unmarried women than for married women, leading to a larger amount of missing data for unmarried women. A multiple imputation method for hierarchical time series data that can account for this type of nonlinear relationship could be of great utility for such applications. Existing multiple imputation methods that address more general nonlinear settings include methods based on classification and regression trees (Burgette and Reiter (2010)), functional data analysis (He, Yucel and Raghunathan (2011)), B-splines (Mbougua et al. (2013)), and generalized additive models for location, scale, and shape (de Jong, van Buuren and Spiess (2016)). We build upon this existing literature to develop a multiple imputation method for continuous hierarchical time series data that can account for a nonlinear relationship between variables that represent refined and coarse measures of the underlying quantity of interest using smoothing splines. We refer to this method as MINTS for Multiple Imputation of hierarchical Nonlinear Time Series data. We focus on the bivariate setting, where the refined measure is the variable for which imputations are desired, and the coarse measure is an auxiliary variable that is easier to measure and has a nonlinear relationship with the refined measure."}
{"chunk_id": "2401.01872v2_sec0_chunk10", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 10, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "measure is the variable for which imputations are desired, and the coarse measure is an auxiliary variable that is easier to measure and has a nonlinear relationship with the refined measure.\n\nThis paper is structured as follows. In Section 2, we describe the motivating case study of secondary school enrollment data in further detail. Section 3 describes the proposed multiple imputation method. In Section 4, we conduct a simulation study to evaluate the out-of-sample validation performance of the proposed multiple imputation method. We compare the performance of the proposed multiple imputation method with several existing multiple imputation methods for estimation of parameters in analysis models that are uncongenial to the imputation model. In Section 5, we conduct two out-of-sample validation exercises using the motivating data set on secondary school enrollment rates, where we evaluate predictive performance for estimation of individual missing values and estimation of parameters in uncongenial analysis models. We also create multiple imputations for the full school enrollment data set and make available 40 multiple imputations for NER created using MINTS. Section 6 includes further discussion and comparisons of the proposed multiple imputation method with existing methods. Finally, we summarize the findings of this paper in Section 7.\n2. Motivating Case Study: Secondary School Enrollment Rates. The UNESCO Institute for Statistics collects internationally comparable data on education indicators on an annual basis for all countries of the world, based largely on survey and administrative data (UNESCO Institute for Statistics (2023))."}
{"chunk_id": "2401.01872v2_sec0_chunk11", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 11, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "internationally comparable data on education indicators on an annual basis for all countries of the world, based largely on survey and administrative data (UNESCO Institute for Statistics (2023)). The World Bank combines this education data with population data from the United Nations Population Division to create estimates of two types of enrollment rates: the Net Enrollment Rate (NER) and the Gross Enrollment Ratio (GER) (World Bank (2021)). We focus on secondary school enrollment. NER is the ratio of children of official secondary school age who are enrolled in secondary school to the population of official secondary school age children. NER is bounded between $0 \\%$ and $100 \\%$ and both the numerator and denominator reflect children of official secondary school age. GER is the ratio of total enrollment in secondary school, regardless of age, to the population of official secondary school age children. The numerator and denominator for GER potentially represent different populations, where children who are not of official secondary school age can be counted in the numerator but not in the denominator. Thus, GER can be greater than $100 \\%$ if children who are enrolled in school are not of official school age. The two measures of enrollment have a strong nonlinear relationship and are subject to the boundary NER $\\leq$ GER.\n\nFor substantive analyses, one measure of enrollment may be preferred over the other. NER can be thought of as a demographic rate, where the numerator counts the number of enrollments for the population of children of official secondary school age in a given year and the"}
{"chunk_id": "2401.01872v2_sec0_chunk12", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 12, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "the other. NER can be thought of as a demographic rate, where the numerator counts the number of enrollments for the population of children of official secondary school age in a given year and the\n\ndenominator counts the person-years lived in that population for the given year. NER can thus be preferable over GER for demographic analyses. However, historical time series of NER tend to have more missing values than time series of GER, as measurement of NER is more difficult than measurement of GER due to requiring knowledge of the age distribution for children enrolled in school. Measurement of GER is comparatively easy, as GER can be calculated using only the number of children who are currently enrolled. For school systems that do not have robust recordkeeping systems and countries that do not have good vital registration systems, knowledge of the age of all enrolled children can be difficult to obtain. The greater availability of estimates of GER and the strong relationship between NER and GER motivates the desire to impute missing values of NER using the relationship between NER and GER."}
{"chunk_id": "2401.01872v2_sec0_chunk13", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 13, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "obtain. The greater availability of estimates of GER and the strong relationship between NER and GER motivates the desire to impute missing values of NER using the relationship between NER and GER.\n\nWe obtain estimates of secondary school enrollment rates for both genders combined from World Bank (2021), ${ }^{1}$ where the definition of secondary school used for each country is based on the International Standard Classification of Education. After excluding all countries and years in the World Bank data base with no observations for either NER or GER, the resulting data set includes 202 countries and 51 years spanning 1970 to 2020 for a total of 10,302 country-year combinations. The overall rate of missingness is about $73.0 \\%$ for NER and about $37.6 \\%$ for GER. Within countries, the rate of missingness for NER ranges from about $13.7 \\%$ missing in Malta to $100 \\%$ missing in 14 countries. For GER, the rate of missingness within countries ranges from about $2.0 \\%$ missing in Peru to about $98.0 \\%$ missing in Curaçao.\n\nFigure 1 shows a scatter plot of the complete cases for NER and GER. The superimposed line illustrates the B-spline of degree 1 fit to the complete cases using the A-splines methodology described in Section 3.2.5. There is a nonlinear relationship between NER and GER, with a shift in trend occurring around GER $=100$. The variation of NER about the fitted spline also appears to vary with GER, with smaller variability at the lowest levels of GER and larger variability around GER $=100$.\n![img-0.jpeg](img-0.jpeg)\n\nFig 1: Scatter plot of complete cases for NER and GER from secondary enrollment data set superimposed with the B-spline of degree 1 fit using A-splines.\n\n[^0]\n[^0]:    ${ }^{1}$ Downloaded on August 5, 2021"}
{"chunk_id": "2401.01872v2_sec0_chunk14", "doc_id": "2401.01872v2", "section_index": 0, "chunk_index": 14, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "plot of complete cases for NER and GER from secondary enrollment data set superimposed with the B-spline of degree 1 fit using A-splines.\n\n[^0]\n[^0]:    ${ }^{1}$ Downloaded on August 5, 2021\n\nTime series of NER and GER are shown in Figure 2 for Afghanistan, Belgium, Spain, and Nigeria. Afghanistan is an example of the most common type of pattern seen for individual countries, where there is a larger number of observed values for GER compared to NER. Only one country, Brazil, has the opposite pattern with one more observed value of GER than observed values of NER. Belgium and Spain are two examples of countries where the nonlinear relationship between NER and GER is visible in the time series for the individual country. Both Belgium and Spain have relatively few missing values for GER, but have large stretches of time with no observations for NER. Finally, Nigeria is an example of a country that has some observed values for GER but has no observed values for NER. There are 14 countries in the school enrollment data set that, like Nigeria, have at least one observation for GER but no observations for NER.\n![img-1.jpeg](img-1.jpeg)\n\nFig 2: Observed values of NER and GER for selected countries from secondary enrollment data set. Open and solid circles indicate observed values for NER and GER, respectively."}
{"chunk_id": "2401.01872v2_sec1_chunk0", "doc_id": "2401.01872v2", "section_index": 1, "chunk_index": 0, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "# 3. Methods. \n\n3.1. Notation. We consider hierarchical time series data where the clustering variable is country and the time variable is year. Let $X_{c, t}$ denote the auxiliary variable and let $Y_{c, t}$ denote the variable of interest for country $c$ and year $t$, where $c \\in 1, \\ldots, C$ and $t \\in 1, \\ldots, T$. The vector of $X_{c, t}$ for all countries at year $t$ is denoted by $\\mathbf{X}_{t}=\\left[X_{1, t}, X_{2, t}, \\ldots, X_{C, t}\\right]$. Similarly, the vector of $Y_{c, t}$ for all countries at year $t$ is denoted by $\\mathbf{Y}_{t}=\\left[Y_{1, t}, Y_{2, t}, \\ldots, Y_{C, t}\\right]$. The $C$ by $T$ matrix of all $X_{c, t}$ is $\\mathbf{X}=\\left[\\mathbf{X}_{1}, \\mathbf{X}_{2}, \\ldots, \\mathbf{X}_{T}\\right]$ and the $C$ by $T$ matrix of all $Y_{c, t}$ is $\\mathbf{Y}=$ $\\left[\\mathbf{Y}_{1}, \\mathbf{Y}_{2}, \\ldots, \\mathbf{Y}_{T}\\right]$.\n\nLet the matrices $\\mathbf{R}^{X}$ and $\\mathbf{R}^{Y}$ denote the response matrices for $\\mathbf{X}$ and $\\mathbf{Y}$, respectively. If an element $(c, t)$ is observed, then the corresponding element of the response matrix equals 1 . For example, if $X_{c, t}$ is observed, then $R_{c, t}^{X}=1$. If $X_{c, t}$ is missing, then $R_{c, t}^{X}=0$. The matrices\n\n$\\mathbf{X}$ and $\\mathbf{Y}$ can also be written in terms of their observed and missing portions. For example, $\\mathbf{X}=\\left[\\mathbf{X}_{\\text {mis }}, \\mathbf{X}_{\\text {obs }}\\right]$ where the observed portion of $\\mathbf{X}$ is denoted $\\mathbf{X}_{\\text {obs }}$ and the unobserved portion of $\\mathbf{X}$ is denoted $\\mathbf{X}_{\\text {mis }}$."}
{"chunk_id": "2401.01872v2_sec1_chunk1", "doc_id": "2401.01872v2", "section_index": 1, "chunk_index": 1, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "{obs }}\\right]$ where the observed portion of $\\mathbf{X}$ is denoted $\\mathbf{X}_{\\text {obs }}$ and the unobserved portion of $\\mathbf{X}$ is denoted $\\mathbf{X}_{\\text {mis }}$.\n\nFor the school enrollment data, the auxiliary variable $\\mathbf{X}$ is GER and the variable of interest $\\mathbf{Y}$ is NER. The enrollment data includes a total of $C=202$ countries, where the assignment of countries to indices $c \\in 1, \\ldots, C$ was done alphabetically by country name. There are $T=$ 51 years in the enrollment data set, where $t=1$ corresponds to the year 1970 and $t=51$ corresponds to the year 2020 ."}
{"chunk_id": "2401.01872v2_sec2_chunk0", "doc_id": "2401.01872v2", "section_index": 2, "chunk_index": 0, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "# 3.2. Model. \n\n3.2.1. Assumptions. We assume the missing data mechanism is ignorable, i.e., the missing data mechanism is Missing At Random (MAR, defined in Section 4.3) and the parameters of the complete data model for $(\\mathbf{X}, \\mathbf{Y})$ are distinct and a priori independent from the parameters of the missing data model governing the response matrices $\\mathbf{R}^{X}$ and $\\mathbf{R}^{Y}$ (Rubin (1976); Schafer (1997a); Little and Rubin (2002)). The assumption of ignorability allows for imputation without specification of a model for the missing data mechanism. Using $\\mathbf{X}$ as an example, imputed values are said to be Bayesianly proper in the sense of Schafer (1997a) if they are independently drawn from the posterior distribution $p\\left(\\mathbf{X}_{\\text {mis }} \\mid \\mathbf{X}_{\\text {obs }}, \\mathbf{R}^{X}\\right)$. When the missing data mechanism is ignorable, proper imputations can instead be drawn from the posterior distribution $p\\left(\\mathbf{X}_{\\text {mis }} \\mid \\mathbf{X}_{\\text {obs }}\\right)=\\int p\\left(\\mathbf{X}_{\\text {mis }} \\mid \\mathbf{X}_{\\text {obs }}, \\theta\\right) p\\left(\\theta \\mid \\mathbf{X}_{\\text {obs }}\\right) d \\theta$ where $\\theta$ is the vector of parameters for the complete data. The assumption of ignorability is ubiquitous for generalpurpose imputation models, but in practice researchers cannot know if this assumption is met. We conducted sensitivity analyses in Sections 4 and 5 to evaluate how well the MINTS method performs when the ignorability assumption is violated."}
{"chunk_id": "2401.01872v2_sec2_chunk1", "doc_id": "2401.01872v2", "section_index": 2, "chunk_index": 1, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "researchers cannot know if this assumption is met. We conducted sensitivity analyses in Sections 4 and 5 to evaluate how well the MINTS method performs when the ignorability assumption is violated.\n\nFinally, we assume that the auxiliary variable is observed at least once for each country for which we are interested in imputing the variable of interest. That is, both $\\mathbf{X}$ and $\\mathbf{Y}$ can contain missing values for any country-year, but we assume that each country has at least one year in which $X_{c, t}$ is observed. This reflects the motivating setting for the proposed imputation method, where the auxiliary variable is more likely to be observed in each country than the variable of interest due to being easier to measure.\n3.2.2. Sequential Decomposition of Joint Model. The MINTS method uses a variation of the joint modeling approach to multiple imputation. In the usual joint modeling approach, the complete data $(\\mathbf{X}, \\mathbf{Y})$ is assumed to follow a multivariate joint distribution and imputed values are sampled from the joint posterior predictive distribution of the missing data given the observed data. One downside to this approach is the difficulty of specifying a joint distribution for all variables used in the imputation model. A common general-purpose choice for the joint distribution is the multivariate normal distribution, which has been found to still perform reasonably well for imputation even when the assumption of normality is violated (Schafer (1997a); Schafer and Olsen (1998)). However, if there are nonlinear relationships between variables in the imputation model, joint modeling assuming multivariate normality is unable to incorporate those relationships."}
{"chunk_id": "2401.01872v2_sec2_chunk2", "doc_id": "2401.01872v2", "section_index": 2, "chunk_index": 2, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "Olsen (1998)). However, if there are nonlinear relationships between variables in the imputation model, joint modeling assuming multivariate normality is unable to incorporate those relationships.\n\nA more flexible approach to multiple imputation is the fully conditional specification (FCS) approach, also known as imputation via chained equations (van Buuren et al. (2006)) and sequential regression multivariate imputation (Raghunathan et al. (2001)), among other names. FCS does not explicitly specify a joint distribution for the variables with missing data. Instead, univariate conditional distributions are specified for each variable with missing data given all other variables in the imputation model. Missing values are imputed by iteratively sampling from the univariate conditional distributions until convergence for all imputation\n\nmodel parameters is reached. The conditional distributions can take any form and can accommodate nonlinear relationships between variables. However, this level of flexibility can lead to cases where the univariate conditional distributions are not compatible. Although simulation studies show that FCS can result in reasonable imputations even when the conditional distributions are not compatible (e.g. van Buuren et al. (2006)), ultimately FCS does not guarantee that the iterative conditional algorithm will converge to a proper joint distribution (Li, Yu and Rubin (2012))."}
{"chunk_id": "2401.01872v2_sec2_chunk3", "doc_id": "2401.01872v2", "section_index": 2, "chunk_index": 3, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "not compatible (e.g. van Buuren et al. (2006)), ultimately FCS does not guarantee that the iterative conditional algorithm will converge to a proper joint distribution (Li, Yu and Rubin (2012)).\n\nWe use an alternative to the usual joint modeling approach that combines desirable features of joint modeling and FCS through a sequential decomposition of the joint model. The sequential decomposition approach for joint modeling was first proposed by Lipsitz and Ibrahim (1996) and has been extended by Ibrahim, Lipsitz and Chen (1999); Ibrahim, Chen and Lipsitz (2002); Lee and Mitra (2016); Xu, Daniels and Winterstein (2016); Lüdtke, Robitzsch and West (2020); among others. The joint distribution of the variables with missing data is decomposed into a sequence of univariate conditional distributions. One possible decomposition of the joint distribution for $(\\mathbf{X}, \\mathbf{Y})$ is\n\n$$\np(\\mathbf{X}, \\mathbf{Y} \\mid \\boldsymbol{\\theta})=p\\left(\\mathbf{Y} \\mid \\mathbf{X}, \\boldsymbol{\\theta}_{Y}\\right) p\\left(\\mathbf{X} \\mid \\boldsymbol{\\theta}_{X}\\right)\n$$\n\nThe vector of parameters for the joint distribution is $\\boldsymbol{\\theta}$, the vector of parameters for the conditional distribution of $\\mathbf{Y} \\mid \\mathbf{X}$ is $\\boldsymbol{\\theta}_{Y}$, and the vector of parameters for the distribution of $\\mathbf{X}$ is $\\boldsymbol{\\theta}_{X}$. Unlike in FCS, this sequence of univariate conditional distributions is guaranteed to correspond to a well-defined joint distribution by construction."}
{"chunk_id": "2401.01872v2_sec2_chunk4", "doc_id": "2401.01872v2", "section_index": 2, "chunk_index": 4, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "of $\\mathbf{X}$ is $\\boldsymbol{\\theta}_{X}$. Unlike in FCS, this sequence of univariate conditional distributions is guaranteed to correspond to a well-defined joint distribution by construction.\n\nThe sequential decomposition approach allows for greater flexibility compared to joint modeling, but is not quite as flexible as FCS due to the additional restriction of requiring an ordering for the conditional distributions. The choice of ordering can have a substantial impact on the performance of the imputation model due to the risk of conditional distributions being incorrectly specified. We follow standard guidelines proposed by Rubin and Schafer (1990) and choose the ordering based on the percentage of missing values. For the ordering in Equation 1, the variable of interest $\\mathbf{Y}$ has a larger amount of missing data compared to the auxiliary variable $\\mathbf{X}$.\n3.2.3. Model Specification. The joint distribution of $(\\mathbf{Y}, \\mathbf{X})$ is decomposed sequentially following Equation 1 as the product of the distribution of $\\mathbf{Y} \\mid \\mathbf{X}$ and the distribution of $\\mathbf{X}$. The distribution of $\\mathbf{X}$ is further decomposed as\n\n$$\np\\left(\\mathbf{X} \\mid \\boldsymbol{\\theta}_{X}\\right)=\\left(\\prod_{t=1}^{T} p\\left(\\mathbf{X}_{t} \\mid \\mathbf{X}_{t-1}, \\boldsymbol{\\theta}_{X}\\right)\\right) p\\left(\\mathbf{X}_{0} \\mid \\boldsymbol{\\theta}_{X}\\right)\n$$\n\nwhere $\\mathbf{X}_{0}$ is a parameter that represents the vector of $X_{c, 0}$ for all countries $c$ at the unobserved year $t=0$. Similarly, the conditional distribution of $\\mathbf{Y} \\mid \\mathbf{X}$ is further decomposed as"}
{"chunk_id": "2401.01872v2_sec2_chunk5", "doc_id": "2401.01872v2", "section_index": 2, "chunk_index": 5, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "that represents the vector of $X_{c, 0}$ for all countries $c$ at the unobserved year $t=0$. Similarly, the conditional distribution of $\\mathbf{Y} \\mid \\mathbf{X}$ is further decomposed as\n\n$$\np\\left(\\mathbf{Y} \\mid \\mathbf{X}, \\boldsymbol{\\theta}_{Y}\\right)=\\left(\\prod_{t=1}^{T} p\\left(\\mathbf{Y}_{t} \\mid \\mathbf{Y}_{t-1}, \\mathbf{X}_{t}, \\boldsymbol{\\theta}_{Y}\\right)\\right) p\\left(\\mathbf{Y}_{0} \\mid \\mathbf{X}_{0}, \\boldsymbol{\\theta}_{Y}\\right)\n$$\n\nwhere $\\mathbf{Y}_{0}$ is a parameter that represents the vector of $Y_{c, 0}$ for all countries $c$ at the unobserved year $t=0$.\n\nThe distribution of $\\mathbf{X}_{t} \\mid \\mathbf{X}_{t-1}, \\boldsymbol{\\theta}_{X}$ is modeled as a random walk with a country-specific drift term $\\gamma_{c}$. For country $c$ and $t \\in 1, \\ldots, T$,\n\n$$\n\\begin{aligned}\nX_{c, t} \\mid X_{c, t-1}, \\boldsymbol{\\theta}_{X} & \\sim T N_{\\left[X_{\\text {low }}, X_{u p}\\right]}\\left(X_{c, t-1}+\\gamma_{c}, \\sigma_{X}^{2}\\right) \\\\\n\\gamma_{c} & \\sim N\\left(\\mu_{\\text {drift }}, \\sigma_{\\text {drift }}^{2}\\right)\n\\end{aligned}\n$$\n\nwhere $T N_{\\left[\\mathrm{X}_{\\text {low }}, \\mathrm{X}_{\\text {up }}\\right]}$ refers to the truncated normal distribution with lower bound $X_{\\text {low }}$ and upper bound $X_{u p}$. These boundaries should be specified based on substantive knowledge about the range of $\\mathbf{X}$ and can vary with $(c, t)$, but the dependency is suppressed in the notation. The country-specific drift terms $\\gamma_{c}$ follow a world-level distribution where $\\mu_{\\text {drift }}$ and $\\sigma_{d r i f t}^{2}$ are world-level hyperparameters."}
{"chunk_id": "2401.01872v2_sec2_chunk6", "doc_id": "2401.01872v2", "section_index": 2, "chunk_index": 6, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "in the notation. The country-specific drift terms $\\gamma_{c}$ follow a world-level distribution where $\\mu_{\\text {drift }}$ and $\\sigma_{d r i f t}^{2}$ are world-level hyperparameters.\n\nThe conditional distribution of $\\mathbf{Y}_{t} \\mid \\mathbf{Y}_{t-1}, \\mathbf{X}_{t}, \\boldsymbol{\\theta}_{Y}$ is modeled with a country-specific intercept $\\alpha_{c}$, a nonlinear function $f$ of $\\mathbf{X}$ with coefficient $\\beta$, and an $\\operatorname{AR}(1)$ term with autoregressive parameter $\\rho$. The variance model for $\\mathbf{Y}_{t} \\mid \\mathbf{Y}_{t-1}, \\mathbf{X}_{t}, \\boldsymbol{\\theta}_{Y}$ models heteroscedasticity as a function $h$ of $\\mathbf{X}$. For country $c$ and $t \\in 1, \\ldots, T$,\n\n$$\n\\begin{aligned}\nY_{c, t} \\mid Y_{c, t-1}, X_{c, t}, \\boldsymbol{\\theta}_{Y} & \\sim T N_{\\left[Y_{l o w}, Y_{u p}\\right]}\\left(\\alpha_{c}+\\beta f\\left(X_{c, t}\\right)+\\rho Y_{c, t-1}, \\sigma_{Y}^{2} h\\left(X_{c, t}\\right)\\right) \\\\\n\\alpha_{c} & \\sim N\\left(\\mu_{0}, \\sigma_{0}^{2}\\right)\n\\end{aligned}\n$$\n\nwhere $T N_{\\left[Y_{l o w}, Y_{u p}\\right]}$ refers to the truncated normal distribution with lower bound $Y_{\\text {low }}$ and upper bound $Y_{u p}$. These boundaries should be specified based on substantive knowledge about the range of $\\mathbf{Y}$ and can vary with $(c, t)$, but the dependency is suppressed in the notation. The country-specific intercepts $\\alpha_{c}$ follow a world-level distribution where $\\mu_{0}$ and $\\sigma_{0}^{2}$ are world-level hyperparameters."}
{"chunk_id": "2401.01872v2_sec3_chunk0", "doc_id": "2401.01872v2", "section_index": 3, "chunk_index": 0, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "# 3.2.4. Prior Distributions. The prior distributions are specified as \n\n$$\n\\begin{aligned}\n\\sigma_{X}^{2} & \\sim \\operatorname{InvGamma}\\left(2, \\delta_{X}\\right) \\\\\n\\mu_{\\text {drift }} & \\sim N\\left(\\nu_{\\text {drift }}, \\zeta_{\\text {drift }}^{2}\\right) \\\\\n\\sigma_{\\text {drift } 2} & \\sim \\operatorname{InvGamma}\\left(2, \\delta_{\\text {drift }}\\right) \\\\\n\\sigma_{Y}^{2} & \\sim \\operatorname{InvGamma}\\left(2, \\delta_{Y}\\right) \\\\\n\\mu_{0} & \\sim N\\left(0, \\zeta_{0}^{2}\\right) \\\\\n\\sigma_{0}^{2} & \\sim \\operatorname{InvGamma}\\left(2, \\delta_{0}\\right) \\\\\n\\beta & \\sim N(0,1) \\\\\n\\rho & \\sim U(0,1)\n\\end{aligned}\n$$\n\nwhere the hyperparameters $\\delta_{X}, \\nu_{\\text {drift }}, \\zeta_{\\text {drift }}, \\delta_{\\text {drift }}, \\delta_{Y}, \\zeta_{0}$, and $\\delta_{0}$ are control parameters that are used to adjust the prior distributions to the appropriate scale for the data.\n\nFor all $c$, the joint prior distribution of $\\left(Y_{c, 0}, X_{c, 0}\\right)$ is a truncated normal distribution with control parameters $\\boldsymbol{\\mu}_{\\text {early }}$ and $\\boldsymbol{\\Sigma}_{\\text {early }}$ given by\n\n$$\n\\left[\\begin{array}{l}\nY_{c, 0} \\\\\nX_{c, 0}\n\\end{array}\\right] \\sim T N\\left(\\boldsymbol{\\mu}_{\\text {early }}, \\boldsymbol{\\Sigma}_{\\text {early }}\\right)\n$$\n\nThe truncation is such that $X_{c, 0} \\in\\left[X_{0, \\text { low }}, X_{0, u p}\\right]$ and $Y_{c, 0} \\in\\left[Y_{0, \\text { low }}, Y_{0, u p}\\right]$. These boundaries should be specified based on substantive knowledge about the ranges of $\\mathbf{X}$ and $\\mathbf{Y}$ and can vary with $c$, but this dependency is suppressed in the notation. The control parameters $\\boldsymbol{\\mu}_{\\text {early }}$ and $\\boldsymbol{\\Sigma}_{\\text {early }}$ are shared across all $c$."}
{"chunk_id": "2401.01872v2_sec3_chunk1", "doc_id": "2401.01872v2", "section_index": 3, "chunk_index": 1, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "vary with $c$, but this dependency is suppressed in the notation. The control parameters $\\boldsymbol{\\mu}_{\\text {early }}$ and $\\boldsymbol{\\Sigma}_{\\text {early }}$ are shared across all $c$.\n\nPriors were chosen to be conjugate and diffuse for most parameters. An informative prior was used for the autoregressive parameter $\\rho$ in the imputation model for $\\mathbf{Y} \\mid \\mathbf{X}$ to reflect the prior belief that $\\mathbf{Y}$ is generally increasing over time for the motivating school enrollment data, but should generally be specified based on the data being imputed. As the spline term $\\beta f\\left(X_{c, t}\\right)$ and the $\\operatorname{AR}(1)$ term $\\rho Y_{c, t-1}$ are both on the scale of $Y_{c, t}$, the parameters $\\beta$ and $\\rho$ can be interpreted as weights that represent the relative importance of the spline term and the\n\n$\\operatorname{AR}(1)$ term. The prior distribution for $\\beta$ was chosen to be on the same order of magnitude as $\\rho$ to reflect this interpretation.\n\nThe values for all hyperparameters should ideally be determined using prior expert knowledge. In the absence of sufficient expertise to specify the prior distributions directly, researchers creating multiple imputations are still likely to have non-expert knowledge of the substantive application that can be used to determine the appropriate order of magnitude for the parameters. Using the school enrollment data as an example, researchers may not have the expertise to specify the prior distributions for $\\mu_{\\text {drift }}$ and $\\sigma_{\\text {drift }}^{2}$ directly. However, they may still have vague prior knowledge that the country-specific drift terms for GER should generally be positive and that increases in school enrollment happen slowly over time for most countries."}
{"chunk_id": "2401.01872v2_sec3_chunk2", "doc_id": "2401.01872v2", "section_index": 3, "chunk_index": 2, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "may still have vague prior knowledge that the country-specific drift terms for GER should generally be positive and that increases in school enrollment happen slowly over time for most countries.\n\nAs an approximate quantification of this type of vague prior knowledge, we propose an algorithm for specifying diffuse priors dictated by data-based control parameters in the absence of prior expert knowledge. The data-based algorithm enables semi-automated specification of prior distributions using sample statistics calculated from the observed data. The control parameters for the prior distributions of the $\\mathbf{X}$ model $\\left(\\delta_{X}, \\nu_{\\text {drift }}, \\zeta_{\\text {drift }}\\right.$, and $\\delta_{\\text {drift }}$ ) are estimated using summary statistics for the observed first differences $X_{c, t}-X_{c, t-1}$ in $\\mathbf{X}_{\\text {obs }}$. Similarly, the control parameters for the prior distributions of the $\\mathbf{Y} \\mid \\mathbf{X}$ model $\\left(\\delta_{Y}, \\zeta_{0}\\right.$, and $\\left.\\delta_{0}\\right)$ are estimated using summary statistics for the observed first differences $Y_{c, t}-Y_{c, t-1}$ in $\\mathbf{Y}_{\\text {obs }}$. The control parameters $\\boldsymbol{\\mu}_{\\text {early }}$ and $\\boldsymbol{\\Sigma}_{\\text {early }}$ for the prior distributions of $\\left(Y_{c, 0}, X_{c, 0}\\right)$ are estimated using summary statistics for $\\mathbf{Y}$ and $\\mathbf{X}$ from a subset of the data that corresponds to \"early\" values of $t$, where the range of $t$ that is considered \"early\" is determined using substantive knowledge of the application."}
{"chunk_id": "2401.01872v2_sec3_chunk3", "doc_id": "2401.01872v2", "section_index": 3, "chunk_index": 3, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "and $\\mathbf{X}$ from a subset of the data that corresponds to \"early\" values of $t$, where the range of $t$ that is considered \"early\" is determined using substantive knowledge of the application. Further details of the algorithm can be found in Section 1 of the Supplementary Material (Liu and Raftery (2025)), and an example illustrating how the algorithm is used to specify prior distributions for the school enrollment data can be found in Section 5.4. We note that use of a data-based algorithm to specify prior distributions results in an approximate posterior distribution rather than a fully Bayesian posterior distribution (Darnieder, 2011).\n\nAlthough the proposed data-based algorithm is designed to specify prior distributions that are sufficiently diffuse such that the control parameters do not overwhelm the posterior inference following the philosophy of Edwards, Lindman and Savage (1963), the prior distributions resulting from the algorithm should not be used blindly. The prior distributions should be checked to ensure they are sensible for the substantive application and do not unnecessarily restrict the parameter space. For the specification of $\\boldsymbol{\\mu}_{\\text {early }}$ and $\\boldsymbol{\\Sigma}_{\\text {early }}$, the data-based algorithm assumes that the time series for $\\mathbf{X}$ and $\\mathbf{Y}$ change smoothly over time and that the unobserved values $\\left(Y_{c, 0}, X_{c, 0}\\right)$ are similar to the observed values in the early subset of data. If there is reason to believe these assumptions are violated, the data-based algorithm should be used with caution.\n3.2.5. A-splines. The nonlinear functions $f$ and $h$ in Equation 3 are estimated through spline regression using the complete cases in $(\\mathbf{X}, \\mathbf{Y})$."}
{"chunk_id": "2401.01872v2_sec3_chunk4", "doc_id": "2401.01872v2", "section_index": 3, "chunk_index": 4, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "should be used with caution.\n3.2.5. A-splines. The nonlinear functions $f$ and $h$ in Equation 3 are estimated through spline regression using the complete cases in $(\\mathbf{X}, \\mathbf{Y})$. To estimate $f$, the model $Y_{c, t}=$ $f\\left(X_{c, t}\\right)+\\varepsilon_{c, t}^{f}$ is fit with Gaussian errors using a B-spline of degree 1. The residuals from the estimation of $f$ are then used to estimate $h$ by fitting the model $\\left|Y_{c, t}-f\\left(X_{c, t}\\right)\\right|=$ $h\\left(X_{c, t}\\right)+\\varepsilon_{c, t}^{h}$ with Gaussian errors and using a B-spline of degree 1. After estimation, $f$ is truncated to have range $\\left[Y_{\\text {low }}, Y_{\\text {up }}\\right]$ and $h$ is truncated to have range $[\\epsilon, \\infty)$, where $\\epsilon$ is a small positive value. The number and placement of knots for the B-splines used for $f$ and $h$ are selected using a method called adaptive splines, or A-splines (Goepp, Bouaziz and Nuel (2018)). A-splines automates the selection of knots using an iterative penalized likelihood approach and is implemented in the R package \"aspline\" (Goepp (2022))."}
{"chunk_id": "2401.01872v2_sec4_chunk0", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 0, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "# 3.3. Estimation. \n\n3.3.1. Model Estimation. The MINTS model is estimated using a Markov chain Monte Carlo (MCMC) algorithm with Gibbs sampling and Metropolis-Hastings steps in R. Multiple imputations are created in two phases. The parameters of the imputation model are first estimated in the estimation phase. In the imputation phase, additional iterations from the same MCMC algorithm are run and used to create multiply imputed data sets.\n\nEstimation of the imputation model parameters occurs simultaneously with estimation of the missing values in a similar fashion to the data augmentation algorithm of Tanner and Wong (1987), with the MCMC algorithm resulting in samples from the joint posterior distribution of the imputation model parameters and the missing values given the observed data. At each iteration of the MCMC algorithm, two steps are iterated until convergence is reached. First, values of the imputation model parameters are drawn from their posterior distributions given the observed data and the most recent estimates of the missing values. Second, estimates for the missing values are drawn from their posterior distributions given the observed data and the previously drawn imputation model parameters.\n\nThe nonlinear functions $f$ and $h$ are estimated before the start of the MCMC algorithm using the complete cases in the data, pooled across countries and times. The same estimates of $f$ and $h$ are used throughout the estimation and imputation phases. $f$ and $h$ are treated as deterministic within the MCMC algorithm, and uncertainty in the estimation of the nonlinear functions is not accounted for."}
{"chunk_id": "2401.01872v2_sec4_chunk1", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 1, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "the estimation and imputation phases. $f$ and $h$ are treated as deterministic within the MCMC algorithm, and uncertainty in the estimation of the nonlinear functions is not accounted for.\n\nLet $\\boldsymbol{\\theta}_{X}=\\left(\\boldsymbol{\\gamma}, \\sigma_{X}^{2}, \\mathbf{X}_{0}, \\mu_{\\text {drift }}, \\sigma_{\\text {drift }}^{2}\\right)$ and $\\boldsymbol{\\theta}_{Y}=\\left(\\boldsymbol{\\alpha}, \\beta, \\rho, \\sigma_{Y}^{2}, \\mathbf{Y}_{0}, \\mu_{0}, \\sigma_{0}^{2}\\right)$ denote the parameters of the models for $\\mathbf{X}$ and $\\mathbf{Y} \\mid \\mathbf{X}$, respectively. The general approach of the MCMC algorithm proceeds as follows for iterations $i=1, \\ldots, n_{\\text {iter }}$ :\n\n1. Draw $\\boldsymbol{\\theta}_{X}^{(i)}$ from $p\\left(\\boldsymbol{\\theta}_{X} \\mid \\mathbf{X}_{\\text {obs }}, \\mathbf{X}_{\\text {mis }}^{(i-1)}\\right)$\n2. Let $j=1, \\ldots, J$ index the $X_{c, t}$ in $\\mathbf{X}_{\\text {mis }}$. For each $j$, draw $X_{j}^{(i)}$ from\n\n$$\np\\left(X_{j} \\mid \\mathbf{X}_{o b s}, X_{1}^{(i)}, X_{2}^{(i)}, \\ldots, X_{j-1}^{(i)}, X_{j+1}^{(i-1)}, \\ldots, X_{J}^{(i-1)}, \\boldsymbol{\\theta}_{X}^{(i)}\\right)\n$$\n\n3. Draw $\\boldsymbol{\\theta}_{Y}^{(i)}$ from $p\\left(\\boldsymbol{\\theta}_{Y} \\mid \\mathbf{Y}_{\\text {obs }}, \\mathbf{Y}_{\\text {mis }}^{(i-1)}, \\mathbf{X}_{\\text {obs }}, \\mathbf{X}_{\\text {mis }}^{(i)}\\right)$\n4. Let $k=1, \\ldots, K$ index the $Y_{c, t}$ in $\\mathbf{Y}_{\\text {mis }}$. For each $k$, draw $Y_{k}^{(i)}$ from\n\n$$\np\\left(Y_{k} \\mid \\mathbf{Y}_{o b s}, Y_{1}^{(i)}, Y_{2}^{(i)}, \\ldots, Y_{k-1}^{(i)}, Y_{k+1}^{(i-1)}, \\ldots, Y_{K}^{(i-1)}, \\mathbf{X}_{o b s}, \\mathbf{X}_{m i s}^{(i)}, \\boldsymbol{\\theta}_{Y}^{(i)}\\right)\n$$"}
{"chunk_id": "2401.01872v2_sec4_chunk2", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 2, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "\\mathbf{Y}_{o b s}, Y_{1}^{(i)}, Y_{2}^{(i)}, \\ldots, Y_{k-1}^{(i)}, Y_{k+1}^{(i-1)}, \\ldots, Y_{K}^{(i-1)}, \\mathbf{X}_{o b s}, \\mathbf{X}_{m i s}^{(i)}, \\boldsymbol{\\theta}_{Y}^{(i)}\\right)\n$$\n\nThe total number of iterations $n_{\\text {iter }}$ used in the estimation phase is determined based on convergence diagnostics such as inspection of trace plots and evaluation of the diagnostics of Raftery and Lewis (1996) and Gelman and Rubin (1992). Complete details of the MCMC algorithm can be found in Section 2 of the Supplementary Material (Liu and Raftery (2025)).\n3.3.2. Imputation Procedure. After the MCMC algorithm has converged for estimation of the imputation model parameters, the imputation phase begins. All iterations of the MCMC that were required for convergence are treated as burn-in during the imputation phase. Imputed values for $\\mathbf{X}_{\\text {mis }}$ and $\\mathbf{Y}_{\\text {mis }}$ are created by continuing the MCMC algorithm with additional thinning steps. Thinning of the MCMC chains is required during the imputation phase to ensure that the imputed data sets are approximately independent draws from the posterior predictive distribution of the missing data given the observed data under the model described in Section 3.2.3 and priors described in Section 3.2.4. The amount of thinning is chosen so that the autocorrelation of the imputed values is approximately zero.\n\nThe number of iterations used in the imputation phase depends on the desired number of multiply imputed data sets, the number of chains of the MCMC, and the number of iterations"}
{"chunk_id": "2401.01872v2_sec4_chunk3", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 3, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "zero.\n\nThe number of iterations used in the imputation phase depends on the desired number of multiply imputed data sets, the number of chains of the MCMC, and the number of iterations\n\nused for thinning. To obtain $M$ multiply imputed data sets from $C$ chains with $n_{\\text {thin }}$ iterations between imputed values, the MCMC algorithm is run for an additional $\\frac{M}{C} \\times n_{\\text {thin }}$ iterations for each chain.\n\nWe note that although missing data is imputed for both $\\mathbf{X}_{\\text {mis }}$ and $\\mathbf{Y}_{\\text {mis }}$, the goal of MINTS is to create multiple imputations of $\\mathbf{Y}$. The auxiliary variable $\\mathbf{X}$ is imputed out of necessity since $\\mathbf{X}$ can also have missing data, but the imputed values of $\\mathbf{X}$ are not intended to be used in subsequent analyses.\n4. Simulation Study. We conducted a simulation study to evaluate how well the MINTS method performs for estimation of analysis models that are uncongenial to the imputation model, where uncongeniality arises because imputation of missing data and analysis of imputed data are conducted independently and information is not shared between imputation and analysis tasks. We refer to this validation exercise as \"analysis model validation.\""}
{"chunk_id": "2401.01872v2_sec4_chunk4", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 4, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "and analysis of imputed data are conducted independently and information is not shared between imputation and analysis tasks. We refer to this validation exercise as \"analysis model validation.\"\n\nAnalysis model validation was conducted for a simulated data set where a nonlinear relationship was simulated between variables. We considered nine experiments corresponding to three rates of simulated missingness and three missing data mechanisms. Each experiment was replicated $N_{\\text {rep }}=1000$ times. The average performance across replications for MINTS was compared with the performance of existing multiple imputation methods for hierarchical time series data. Details of the simulation study using the nonlinear simulated data are presented in this section, while details of an analogous simulation study using linear simulated data are available in Sections 5 and 6 of the Supplementary Material (Liu and Raftery (2025)).\n4.1. Data Generation. Variables $\\mathbf{X}$ and $\\mathbf{Y}$ were generated for 20 countries and 30 years for a total sample size of 600 country-years. $\\mathbf{Y}$ is the variable of interest for substantive analyses, while $\\mathbf{X}$ is an auxiliary variable that is only of interest for imputation of $\\mathbf{Y}$.\n$\\mathbf{X}$ was simulated independently for each country and is bounded in $[0,100]$. For country $c$,\n\n$$\n\\begin{aligned}\nX_{c, 1} & \\left.\\sim U\\left(X_{1, l o w}, X_{1, u p}\\right)\\right. \\\\\nX_{c, t+1} & \\left.\\sim T N_{[0,100]}\\left(X_{c, t}+\\gamma_{c}, \\sigma^{2}\\right) \\text { for } t=1, \\ldots, 29\\right)\n\\end{aligned}\n$$"}
{"chunk_id": "2401.01872v2_sec4_chunk5", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 5, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "& \\left.\\sim U\\left(X_{1, l o w}, X_{1, u p}\\right)\\right. \\\\\nX_{c, t+1} & \\left.\\sim T N_{[0,100]}\\left(X_{c, t}+\\gamma_{c}, \\sigma^{2}\\right) \\text { for } t=1, \\ldots, 29\\right)\n\\end{aligned}\n$$\n\nwhere $T N_{[0,100]}$ refers to the truncated normal distribution with support $[0,100]$ and $\\gamma_{c}$ is a country-specific drift term. For the nonlinear simulated data, we set $X_{1, l o w}=0, X_{1, u p}=25$, $\\sigma^{2}=1$, and $\\gamma_{c} \\sim U(1,3)$.\n$\\mathbf{Y}$ was simulated to have a nonlinear relationship with $\\mathbf{X}$ and is bounded as $Y_{c, t} \\in$ $\\left[0, \\min \\left(X_{c, t}, 60\\right)\\right]$. For country $c$,\n\n$$\n\\begin{aligned}\nY_{c, t} & \\left.\\sim T N_{\\left[0, \\min \\left(X_{c, t}, 60\\right)\\right]}\\left(\\alpha_{c}+\\frac{40}{\\left(1+\\exp \\left(-\\frac{X_{c, t}-60}{8}\\right)\\right)}+3 \\log \\left(X_{c, t}\\right), 1^{2}\\right) \\\\\n\\alpha_{c} & \\left.\\sim U(0,5)\\right)\n\\end{aligned}\n$$\n\nwhere $T N_{\\left[0, \\min \\left(X_{c, t}, 60\\right)\\right]}$ refers to the truncated normal distribution with support $\\left[0, \\min \\left(X_{c, t}, 60\\right)\\right]$. $\\mathbf{X}$ and $\\mathbf{Y}$ were constructed to have a generally monotonically increasing relationship similar to the relationship observed for the enrollment data. We assume that the bounds of $\\mathbf{X}$ and $\\mathbf{Y}$ are known to the imputer.\n4.2. Analysis Model. We focused on the setting where the analysis model is uncongenial to the imputation model. The variable $\\mathbf{Z}$ is treated as the outcome variable and was simulated\n\nto have a linear relationship with $\\mathbf{Y}$. For each country $c$ and year $t$,\n\n$$\n\\begin{aligned}\nZ_{c, t} & \\sim N\\left(\\eta_{c}+2 Y_{c, t}, 10^{2}\\right) \\\\\n\\eta_{c} & \\sim U(0,15)\n\\end{aligned}\n$$"}
{"chunk_id": "2401.01872v2_sec4_chunk6", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 6, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "a linear relationship with $\\mathbf{Y}$. For each country $c$ and year $t$,\n\n$$\n\\begin{aligned}\nZ_{c, t} & \\sim N\\left(\\eta_{c}+2 Y_{c, t}, 10^{2}\\right) \\\\\n\\eta_{c} & \\sim U(0,15)\n\\end{aligned}\n$$\n\nThe analysis model is the linear regression of $\\mathbf{Z}$ on $\\mathbf{Y}$. The parameter of interest is $\\omega_{1}$, the coefficient on $\\mathbf{Y}$ in the regression\n\n$$\n\\begin{aligned}\nZ_{c, t} & =\\omega_{0}+\\omega_{1} Y_{c, t}+\\varepsilon_{c, t}^{\\omega} \\\\\n\\varepsilon_{c, t}^{\\omega} & \\sim N\\left(0, \\sigma_{\\varepsilon_{\\omega}}^{2}\\right)\n\\end{aligned}\n$$\n\nThis analysis model is uncongenial to the imputation model due to the presence of $\\mathbf{Z}$, which is not included in any of the imputation models considered. We assume $\\mathbf{X}$ is only available during the imputation task and is not possible to include in subsequent analyses. For example, this could occur if the refined measure $\\mathbf{Y}$ comes from survey data and the coarse measure $\\mathbf{X}$ comes from confidential administrative records data. Multiply imputed values of $\\mathbf{Y}$ are desired for public release, but $\\mathbf{X}$ cannot be made publicly available. We also assume $\\mathbf{Z}$ is only available during the analysis task and is not possible to include in the imputation model. This could occur if $\\mathbf{Z}$ is collected by the analyst after the multiple imputation task is complete or because $\\mathbf{Z}$ is unavailable to the imputer for data confidentiality reasons. We note that omitted variable bias is likely to occur in this setting due to the omission of $\\mathbf{Z}$ in the imputation model, so a data augmentation approach based on MINTS that incorporates $\\mathbf{Z}$ into the imputation model is also considered in the validation exercises for comparison purposes."}
{"chunk_id": "2401.01872v2_sec4_chunk7", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 7, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "the imputation model, so a data augmentation approach based on MINTS that incorporates $\\mathbf{Z}$ into the imputation model is also considered in the validation exercises for comparison purposes.\n\nAdditional validation results for a random intercept analysis model can be found in Section 4 of the Supplementary Material (Liu and Raftery (2025)).\n4.3. Analysis Model Validation Procedure. Data was simulated as missing following the three missing data mechanisms of Rubin (1976): Missing Completely At Random (MCAR), Missing At Random (MAR), and Missing Not at Random (MNAR). For a variable X, MCAR occurs when $P\\left(\\mathbf{R}^{X} \\mid \\mathbf{X}\\right)=P\\left(\\mathbf{R}^{X}\\right)$. Data was simulated as missing under MCAR by assuming that each observation has the same probability of being missing. MAR occurs when $P\\left(\\mathbf{R}^{X} \\mid \\mathbf{X}\\right)=P\\left(\\mathbf{R}^{X} \\mid \\mathbf{X}_{\\text {obs }}\\right)$. Data was simulated as missing under MAR by assuming that observations in earlier years are more likely to be missing. Finally, MNAR occurs when the probability of being missing depends on both the missing and the observed data and $P\\left(\\mathbf{R}^{X} \\mid \\mathbf{X}\\right)$ cannot be simplified further. Data was simulated as missing under MNAR by assuming that the probability of $\\mathbf{X}$ being missing depends on the value of $\\mathbf{X}$. Details of the MAR and MNAR implementations can be found in Section 3 of the Supplementary Material (Liu and Raftery (2025))."}
{"chunk_id": "2401.01872v2_sec4_chunk8", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 8, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "of $\\mathbf{X}$ being missing depends on the value of $\\mathbf{X}$. Details of the MAR and MNAR implementations can be found in Section 3 of the Supplementary Material (Liu and Raftery (2025)).\n\nFor each missing data mechanism, data was simulated as missing at the $10 \\%, 40 \\%$, and $80 \\%$ rates. Each combination of missing data mechanism and rate was implemented simultaneously for $\\mathbf{X}$ and $\\mathbf{Y}$ and defines an experiment. For example, the MCAR $10 \\%$ experiment corresponds to the setting where $10 \\%$ of $\\mathbf{X}$ was simulated as missing under MCAR and $10 \\%$ of $\\mathbf{Y}$ was simulated as missing under MCAR. We note that while $80 \\%$ is a high rate of missingness, it is similar to the observed rate of $73.0 \\%$ missingness for NER in the school enrollment data set.\n\nAll multiple imputation methods compared in the validation exercises assume that the missing data mechanism is MAR and that there is sufficient information from the observed data to adequately estimate the relationship between $\\mathbf{X}$ and $\\mathbf{Y}$. The experiments where data is simulated under MNAR act as a sensitivity analysis to evaluate each method's performance when the MAR assumption is violated. Similarly, the experiments using the $80 \\%$ rate of\n\nsimulated missingness are considered to assess how well each method performs when there is a very large amount of missing data. In practice, substantive knowledge about the variables with missing data should be used to determine if multiple imputation is appropriate for use if the missing data mechanism is suspected to be MNAR or if there are large amounts of missing data.\n\nFor each experiment, the analysis model validation procedure is"}
{"chunk_id": "2401.01872v2_sec4_chunk9", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 9, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "is appropriate for use if the missing data mechanism is suspected to be MNAR or if there are large amounts of missing data.\n\nFor each experiment, the analysis model validation procedure is\n\n1. For replication $r=1, \\ldots, N_{\\text {rep }}$,\na) Simulate missing values according to the experiment's missing data mechanism and rate to separate the data into \"observed\" and \"missing\" data\nb) Run the multiple imputation procedure using the observed data to create $M=40$ completed data sets. Completed data sets consist of the observed data and the imputed values for the missing data.\nc) Estimate quantities of interest $Q$ using each of the $M$ completed data sets\nd) Pool the estimates of $Q$ and $S E(Q)$ across the $M$ completed data sets using combining rules from Rubin (1987) to obtain the pooled estimates $\\bar{Q}_{r}$ and $S E\\left(\\bar{Q}_{r}\\right)$\n2. Calculate the true value of $Q$ using the full data set\n3. Calculate evaluation metrics for the pooled estimates $\\bar{Q}_{r}$ averaged across replications\n\nThe number of imputations $M=40$ was chosen to balance between having a large enough number of imputations to guarantee minimal contribution of simulation error to the variability of estimands and having a small enough number of imputations to be computationally feasible."}
{"chunk_id": "2401.01872v2_sec4_chunk10", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 10, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "enough number of imputations to guarantee minimal contribution of simulation error to the variability of estimands and having a small enough number of imputations to be computationally feasible.\n\nPooled estimates for each scalar quantity of interest $Q$ are created using combining rules from Rubin (1987) in Step 1(d) of the validation procedure. Let $\\bar{Q}_{m}$ denote the point estimate of $Q$ from imputation $m$ and let $\\bar{U}_{m}$ denote its associated variance. The pooled point estimate of $Q$ across all $M$ imputations is $\\bar{Q}_{M}=\\frac{1}{M} \\sum_{m=1}^{M} \\bar{Q}_{m}$. The pooled variance estimate of $\\bar{Q}_{M}$ is $T_{M}=\\bar{U}_{M}+\\left(1+\\frac{1}{M}\\right) B_{M}$, where $\\bar{U}_{M}=\\frac{1}{M} \\sum_{m=1}^{M} \\bar{U}_{m}$ is the average within-imputation variance and $B_{M}=\\frac{1}{M-1} \\sum_{m=1}^{M}\\left(\\bar{Q}_{m}-\\bar{Q}_{M}\\right)^{T}\\left(\\bar{Q}_{m}-\\bar{Q}_{M}\\right)$ is the betweenimputation variance. The $95 \\%$ confidence interval for the pooled estimate $\\bar{Q}_{M}$ is constructed using $\\bar{Q}_{M} \\pm t_{\\nu}^{*} \\sqrt{T_{M}}$, where $t_{\\nu}^{*}$ is the critical value for $95 \\%$ confidence from the $t$ distribution with $\\nu$ degrees of freedom. The degrees of freedom $\\nu$ for finite number of imputations $M$ is $\\nu=(M-1)\\left(1+\\frac{1}{r_{M}}\\right)^{2}$, where $r_{M}$ is the relative increase in variance due to nonresponse given by $r_{M}=\\left(1+\\frac{1}{M}\\right) \\frac{B_{M}}{\\bar{U}_{M}}$."}
{"chunk_id": "2401.01872v2_sec4_chunk11", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 11, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "$M$ is $\\nu=(M-1)\\left(1+\\frac{1}{r_{M}}\\right)^{2}$, where $r_{M}$ is the relative increase in variance due to nonresponse given by $r_{M}=\\left(1+\\frac{1}{M}\\right) \\frac{B_{M}}{\\bar{U}_{M}}$.\n\nThe performance of the point estimates $\\bar{Q}_{M}$ was evaluated using the mean absolute error (MAE), calculated as $\\frac{1}{N_{\\text {rep }}} \\sum_{r}\\left|\\bar{Q}_{M}-Q\\right|$ where the sum is taken over all replications within each experiment. The performance of the $95 \\%$ confidence intervals for the pooled estimates $\\bar{Q}_{M}$ was evaluated using the mean coverage across all replications within each experiment, calculated as the proportion of intervals that contained the true value. We also evaluated the mean fraction of Fisher information about $Q$ that is missing due to nonresponse, which we abbreviate as FMI for Fraction of Missing Information. In each replication of each experiment, FMI is estimated as\n\n$$\n\\text { FMI }=\\frac{r_{M}+\\frac{2}{\\nu+3}}{r_{M}+1}\n$$\n\nThe mean FMI across all replications within each experiment enables assessment of the amount of information about $Q$ that is lost due to the presence of missing data (Schafer (1997a); Savalei and Rhemtulla (2012)). We note that with $M=40$ imputations, the estimates of FMI may be noisy, so in this case FMI should only be interpreted as an exploratory diagnostic (Bodner (2008); Enders (2010))."}
{"chunk_id": "2401.01872v2_sec4_chunk12", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 12, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "(2012)). We note that with $M=40$ imputations, the estimates of FMI may be noisy, so in this case FMI should only be interpreted as an exploratory diagnostic (Bodner (2008); Enders (2010)).\n\n4.4. Model Implementation. For each replication of each experiment, we created 40 imputations using the MINTS method by running 10 chains of the MCMC algorithm. The bounds of the model for $\\mathbf{X}$ were set as $X_{\\text {low }}=0$ and $X_{u p}=100$, and the bounds of the model for $\\mathbf{Y} \\mid \\mathbf{X}$ were set as $Y_{\\text {low }}=0$ and $Y_{u p}=\\min \\left(X_{c, t}, 60\\right)$. During the estimation phase, the MCMC algorithm was run for enough iterations to ensure convergence of all imputation model parameters. The number of iterations differed across experiments, but ranged from 10,000 to 25,000 iterations per chain. During the imputation phase, an additional 4,000 iterations was run for each chain and four iterations from each chain were selected as the imputed values. The iterations selected as the final imputed values were chosen to be 1,000 iterations apart to ensure autocorrelation was close to zero following the procedure described in Section 3.3.2.\n\nWe compared the MINTS method to six models based on existing methods for multiple imputation. As the existing methods assume a linear relationship between variables with missing data, the simulated data was transformed prior to creating multiple imputations using a Box-Cox transformation. For each of the existing methods, $\\mathbf{Y}$ was first transformed using the cube root as $\\mathbf{Y}^{*}=\\mathbf{Y}^{1 / 3}$. Imputations were created on the transformed scale, and the resulting multiply imputed values of $\\mathbf{Y}^{*}$ were transformed back to the original scale of $\\mathbf{Y}$."}
{"chunk_id": "2401.01872v2_sec4_chunk13", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 13, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "/ 3}$. Imputations were created on the transformed scale, and the resulting multiply imputed values of $\\mathbf{Y}^{*}$ were transformed back to the original scale of $\\mathbf{Y}$.\n\nThree of the existing multiple imputation models considered are based on the MICE methodology as implemented in the R package \"mice\" (van Buuren and GroothuisOudshoorn (2011)). ${ }^{2}$ MICE uses the FCS algorithm, which allows for the specification of separate univariate conditional models for each variable with missing data. The univariate conditional models include all available variables as predictors, for example, the model for $\\mathbf{X}$ includes $\\mathbf{Y}$, year, and country as predictors. We first considered the default imputation method for continuous data in the mice package, which is predictive mean matching. We refer to this model as MICE PMM. Unlike the other approaches considered, MICE PMM does not explicitly account for the hierarchical structure of the data but is included as a baseline for comparison."}
{"chunk_id": "2401.01872v2_sec4_chunk14", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 14, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "to this model as MICE PMM. Unlike the other approaches considered, MICE PMM does not explicitly account for the hierarchical structure of the data but is included as a baseline for comparison.\n\nWe evaluated two models within the MICE framework that account for the hierarchical structure of the data using the method of Schafer (1997b) and Schafer and Yucel (2002), referred to as the pan method following its implementation in the R package \"pan\" (Zhao and Schafer (2023)). The function mice.impute.2l.pan within the mice package uses a Gibbs sampler to estimate the conditional linear mixed effects model with homogeneous withingroup variances for each variable with missing data given the other variables. We evaluated a model that includes a country-specific intercept and fixed effects for all covariates in the imputation model. We refer to this model as pan Fixed Effects. For example, imputed values for $X_{c, t} \\mid Y_{c, t}$ are modeled with a country-specific intercept, a fixed effect of year, a fixed effect of $Y_{c, t}$, and a homogeneous normally distributed error term. We also considered the pan Random Effects model, which adds random effects of all covariates to the model used in pan Fixed Effects."}
{"chunk_id": "2401.01872v2_sec4_chunk15", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 15, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "$Y_{c, t}$, and a homogeneous normally distributed error term. We also considered the pan Random Effects model, which adds random effects of all covariates to the model used in pan Fixed Effects.\n\nWe evaluated three models using the Amelia II methodology as implemented in the R package \"Amelia\" (Honaker and King (2010)). ${ }^{3}$ For complete data $(\\mathbf{X}, \\mathbf{Y})$, Amelia assumes the joint distribution is multivariate normal. The parameters of the joint distribution are estimated using a combination of bootstrapping and an EM algorithm. Amelia is designed specifically for imputation of hierarchical time series data, which Honaker and King refer to as time series cross-sectional data, through modeling features such as smooth trends over time and allowing for country-specific effects. For our comparisons, we evaluated three implementations of Amelia that were chosen to use the simplest form of the time-series-cross-sectional\n\n[^0]\n[^0]:    ${ }^{2}$ mice version 3.14.0 used\n    ${ }^{3}$ Amelia version 1.80 used\n\nmodeling features in Amelia: a time-series (TS) model, a cross-sectional (CS) model, and a time-series-cross-sectional (TSCS) model. All three of the imputation models are constructed by adding terms to the default multivariate normal joint model for $(\\mathbf{X}, \\mathbf{Y})$. In the Amelia TS model, a linear effect of time is added. In the Amelia CS model, a country-specific intercept term is added. In the Amelia TSCS model, a country-specific intercept term and a countryspecific linear effect of time are added."}
{"chunk_id": "2401.01872v2_sec4_chunk16", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 16, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "time is added. In the Amelia CS model, a country-specific intercept term is added. In the Amelia TSCS model, a country-specific intercept term and a countryspecific linear effect of time are added.\n\nImputations were created using the default settings in mice and Amelia, with the exception of setting the number of imputations as $M=40$, specifying the form of the imputation models as described above, and specifying bounds of $\\mathbf{X} \\in[0,100]$ and $\\mathbf{Y} \\in[0,60]$. Scalar bounds were used for $\\mathbf{Y}$ as the mice and Amelia packages do not allow for variable bounds.\n\nWe also considered a data augmentation approach that extends the MINTS method to enable estimation of the parameters of the analysis model through the decomposition\n\n$$\np\\left(\\mathbf{Z}, \\mathbf{Y}, \\mathbf{X} \\mid \\boldsymbol{\\theta}_{Z}, \\boldsymbol{\\theta}_{Y}, \\boldsymbol{\\theta}_{X}\\right)=p\\left(\\mathbf{Z} \\mid \\mathbf{Y}, \\mathbf{X}, \\boldsymbol{\\theta}_{Z}\\right) p\\left(\\mathbf{Y} \\mid \\mathbf{X}, \\boldsymbol{\\theta}_{Y}\\right) p\\left(\\mathbf{X} \\mid \\boldsymbol{\\theta}_{X}\\right)\n$$"}
{"chunk_id": "2401.01872v2_sec4_chunk17", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 17, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "\\mid \\mathbf{Y}, \\mathbf{X}, \\boldsymbol{\\theta}_{Z}\\right) p\\left(\\mathbf{Y} \\mid \\mathbf{X}, \\boldsymbol{\\theta}_{Y}\\right) p\\left(\\mathbf{X} \\mid \\boldsymbol{\\theta}_{X}\\right)\n$$\n\nwhere $\\boldsymbol{\\theta}_{Z}$ denotes the parameters of the analysis model. The data augmentation approach uses the same models for $\\mathbf{Y} \\mid \\mathbf{X}$ and $\\mathbf{X}$ as MINTS, while the model for $\\mathbf{Z} \\mid \\mathbf{Y}, \\mathbf{X}$ is given by the analysis model used in the validation exercise. We abbreviate the data augmentation approach based on MINTS as the MINTS DA method. MINTS DA can be used to directly sample from the posterior distributions for the parameters of the analysis model rather than needing to rely on the multiple imputation framework. Medians of the posterior distributions for parameters of interest were used for point estimates, while the 0.025 th and 0.975 th quantiles of the posterior distributions were used for interval estimates. As the estimates of the parameters of interest are not constructed using Rubin's pooling rules, we did not calculate estimates of the Fraction of Missing Information. We note that MINTS DA is considered only for comparison purposes as a method that directly incorporates information about $\\mathbf{Z}$ when handling missing data in $\\mathbf{Y}$ and $\\mathbf{X}$. In practice, the data augmentation approach is not possible to implement in our motivating setting where the substantive analysis of interest and imputation of missing data are conducted independently, and information about $\\mathbf{Z}$ and $\\mathbf{X}$ are not shared between analyst and imputer.\n4.5. Analysis Model Validation Results."}
{"chunk_id": "2401.01872v2_sec4_chunk18", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 18, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "and imputation of missing data are conducted independently, and information about $\\mathbf{Z}$ and $\\mathbf{X}$ are not shared between analyst and imputer.\n4.5. Analysis Model Validation Results. For the linear regression analysis model validation, we evaluated how well each multiple imputation method performs for estimation of $Q=\\omega_{1}$, the regression coefficient on $\\mathbf{Y}$ in the linear regression of $\\mathbf{Z}$ on $\\mathbf{Y}$. Table 1 summarizes the results of this validation exercise.\n\nOverall, we found MINTS results in the best balance between MAE, coverage, and FMI. Out of the multiple imputation methods considered, MINTS has the smallest MAE in all experiments except MAR $10 \\%$ and MAR $40 \\%$, where MINTS has the second smallest MAE behind MICE PMM. MINTS has reasonably close to nominal coverage for $95 \\%$ intervals at the $10 \\%$ and $40 \\%$ rates of simulated missingness, but suffers from undercoverage at the $80 \\%$ rate. The Amelia TSCS method has closer to nominal coverage than MINTS in the MCAR $80 \\%$ and MNAR $80 \\%$ experiments at the expense of higher MAE, but MINTS has the closest to nominal coverage in the MAR $80 \\%$ experiment."}
{"chunk_id": "2401.01872v2_sec4_chunk19", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 19, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "has closer to nominal coverage than MINTS in the MCAR $80 \\%$ and MNAR $80 \\%$ experiments at the expense of higher MAE, but MINTS has the closest to nominal coverage in the MAR $80 \\%$ experiment.\n\nMINTS has the smallest FMI in eight out of nine experiments. As expected, FMI is much larger for all methods at the $80 \\%$ rate, with FMI $>50 \\%$ for several methods. This is higher than is typical for the setting of sample survey data that multiple imputation was originally designed for, where FMI is usually $\\leq 30 \\%$ (Rubin 2007). Given the high FMI, it is thus unsurprising how poorly all multiple imputation methods perform in the experiments at the $80 \\%$ rate. In particular, the spline estimation used in MINTS suffers from overfitting at the $80 \\%$ rate due to the small number of complete cases available to estimate the splines $f$ and $h$, with some replications having less than 15 complete cases.\n\nNone of the existing multiple imputation methods perform consistently well across experiments for estimation of $\\omega_{1}$. While MICE PMM can outperform the methods explicitly designed for hierarchical time series data at the lower rates of missingness, the performance of MICE PMM suffers greatly at the highest rate of missingness. The pan and Amelia methods perform similarly to one another at the $10 \\%$ rate, but all have larger MAE than MICE PMM. Performance of the pan and Amelia methods generally is best under MCAR, with pan Random Effects and Amelia TSCS performing the best of the group in terms of MAE and coverage."}
{"chunk_id": "2401.01872v2_sec4_chunk20", "doc_id": "2401.01872v2", "section_index": 4, "chunk_index": 20, "title": "Multiple Imputation of Hierarchical Nonlinear Time Series Data with an\n  Application to School Enrollment Data", "section_heading": "", "text": "MAE than MICE PMM. Performance of the pan and Amelia methods generally is best under MCAR, with pan Random Effects and Amelia TSCS performing the best of the group in terms of MAE and coverage.\n\nMultiple imputation using the MINTS method generally has better performance than the data augmentation approach based on MINTS at the lower rates of simulated missingness. However, the data augmentation approach has smaller MAE than all multiple imputation methods at the highest rate of simulated missingness. The multiple imputation methods all have substantial undercoverage in the MAR $80 \\%$ and MNAR $80 \\%$ experiments, while the data augmentation approach maintains close to nominal coverage. These findings suggest that omission of $\\mathbf{Z}$ from the imputation model is likely a major source of bias and undercoverage for the multiple imputation methods when there is a small number of observed values.\n\nTABLE 1\nSummary of analysis model validation for nonlinear simulated data for $Q=\\omega_{1}$, the regression coefficient on $Y$ in the linear regression of $Z$ on $Y$. MAE denotes mean absolute error, Cvg denotes the average coverage of $95 \\%$ intervals as a percentage, and FMI denotes the fraction of missing information as a percentage. MAE is multiplied by 100 before reporting. Results are averaged over the 1000 replications of each experiment. The true value of $Q$ is 2.060 .\n\n![table_0](table_0)"}
